const data = [
  {
    time: "2016-02-20",
    children: [
      {
        imgs: ["2016022006.jpg"],
        text:
          "做到最后我发现30+行代码就能解决所有问题，根本不需要计算！真不知道是该哭还是笑"
      },
      {
        imgs: [
          "2016022001.jpg",
          "2016022002.jpg",
          "2016022003.jpg",
          "2016022004.jpg",
          "2016022005.jpg"
        ],
        text: "全是数学逻辑的移动导航，脑子要爆炸了（最后一张样图）"
      }
    ]
  },
  {
    time: "2016-02-18",
    children: [
      {
        imgs: ["20160118.jpg"],
        text: "这有毒的五月终于搞定了，要吐血了"
      }
    ]
  },
  {
    time: "2016-02-17",
    children: [
      {
        imgs: ["20160117.jpg"],
        text: "日历功能实现了，不过刚发现手机排版有些问题！简直不科学。"
      }
    ]
  }
];

export default data;
