const data = [
  {
    time: "2016-04-02",
    children: [
      {
        imgs: ["20160402.jpg"],
        text:
          "终于把标签部分全都完成了，这个过程真的是爽的不行，单个标签就用到了不少html,bootstrap,jquery,ajax,php,mysql里的东西，这写代码只能基本靠查手册，混合语言编码确实烦，经常记了这个的忘了那个的"
      }
    ]
  },
  {
    time: "2016-04-01",
    children: [
      {
        imgs: ["20160401.jpg"],
        text:
          "做完这个标签我再也不会认为看上去简单网站容易做了，这个小小的标签折腾死我了"
      }
    ]
  },
  {
    time: "2016-03-31",
    children: [
      {
        text: "做着做着又卡住了，数据库知识出现了短板，我真的想静静"
      }
    ]
  },
  {
    time: "2016-03-29",
    children: [
      {
        imgs: ["2016032902.jpg"],
        text:
          "今天听学长一说，才发现我现在需要的不是各种技术，而是最基本的编码规范！！！现在我要把主要的方向放在怎么写出规范上了"
      },
      {
        text:
          "HTML5通常包含的一些标准: SVG  ,  CSS3  ,  WebGL  ,  Web Workers  ,  Web Storage  ,  Web SQL Database  ,  Web Sockets  ,  Geolocation  ,  Microdata  ,  Device API  ,  File API"
      },
      {
        imgs: ["2016032901.jpg"],
        text:
          "寒假就把ajax挂在嘴上，今天终于用上了，点击 + 后。页面无刷新的将html5提交数据库并在下方显示，用过之后才明白ajax的强大"
      }
    ]
  },
  {
    time: "2016-03-26",
    children: [
      {
        imgs: ["2016032604.jpg"],
        text: "破解版get"
      },
      {
        imgs: ["2016032601.jpg", "2016032602.jpg", "2016032603.jpg"],
        text: "换波书看看"
      }
    ]
  },
  {
    time: "2016-03-25",
    children: [
      {
        imgs: ["2016032502.jpg"],
        text: "又一张，除了添加图片其他功能都完成啦"
      },
      {
        imgs: ["2016032501.jpg"],
        text: "果然第一周的css没白花功夫，就算是动态数据样式也基本没问题了"
      }
    ]
  },
  {
    time: "2016-03-24",
    children: [
      {
        imgs: ["2016032403.jpg"],
        text:
          "第一页的大致功能完成了，不过这样式布局目前还没找到好的方法，php动态输出的数据没法想静态网页任意布局，感觉我又要滚回去学习动站布局了"
      },
      {
        imgs: ["2016032401.jpg", "2016032402.jpg"],
        text: "继续完成我的简陋不安全的记事本"
      }
    ]
  },
  {
    time: "2016-03-18",
    children: [
      {
        imgs: ["2016031801.jpg", "2016031802.jpg", "2016031803.jpg"],
        text: "学会了发送和接收消息，再做记事本基本不成问题了"
      }
    ]
  },
  {
    time: "2016-03-15",
    children: [
      {
        imgs: [
          "2016031501.jpg",
          "2016031502.jpg",
          "2016031503.jpg",
          "2016031504.jpg",
          "2016031505.jpg"
        ],
        text: "从注册到激活，登录，个人中心，分页完成了，然而才学了三分之一"
      }
    ]
  },
  {
    time: "2016-03-11",
    children: [
      {
        imgs: ["2016031101.jpg", "2016031102.jpg", "2016031103.jpg"],
        text: "一星期了，才学到将注册表单写入数据库"
      }
    ]
  },
  {
    time: "2016-03-02",
    children: [
      {
        imgs: ["20160302.jpg"],
        text:
          "实现了ajax输出页面，不过手机排版根本不能看，只能日后为手机专门做一个样式表"
      }
    ]
  },
  {
    time: "2016-02-29",
    children: [
      {
        imgs: ["2016022904.jpg"],
        text: "好像有点感觉了"
      },
      {
        imgs: ["2016022903.jpg"],
        text: "只有点图像的边框才有反应，这游戏好难"
      },
      {
        imgs: ["2016022901.jpg", "2016022902.jpg"],
        text: "同样都是手机浏览器，显示样式怎么就辣么大呢"
      }
    ]
  },
  {
    time: "2016-02-20",
    children: [
      {
        imgs: ["2016022006.jpg"],
        text:
          "做到最后我发现30+行代码就能解决所有问题，根本不需要计算！真不知道是该哭还是笑"
      },
      {
        imgs: [
          "2016022001.jpg",
          "2016022002.jpg",
          "2016022003.jpg",
          "2016022004.jpg",
          "2016022005.jpg"
        ],
        text: "全是数学逻辑的移动导航，脑子要爆炸了（最后一张样图）"
      }
    ]
  },
  {
    time: "2016-02-18",
    children: [
      {
        imgs: ["20160118.jpg"],
        text: "这有毒的五月终于搞定了，要吐血了"
      }
    ]
  },
  {
    time: "2016-02-17",
    children: [
      {
        imgs: ["20160117.jpg"],
        text: "日历功能实现了，不过刚发现手机排版有些问题！简直不科学。"
      }
    ]
  }
];

export default data;
